
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ISAWASHUN/aws-ecs-terraform/actions/runs/7026613947)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b3ef89bfa78b0582]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7b762bcf5433586]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:targetgroup/go-simple-server-target-group/7f1ffbb450bcb047]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00c0ff2d63eb7c1b5]
aws_security_group.ecs: Refreshing state... [id=sg-09e7170c13ba44315]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-04644499e1d35015a]
aws_security_group.alb: Refreshing state... [id=sg-0aebc2e899f086fe5]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0279be51cdd95b4c7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02f39c8c10ab62646]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f501f908d74e8b94]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09afe4d2b31cc1a60]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05a4d2914ca9edc60]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f9db97024b495556]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d9de1c8bc96a790d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05a9889ad7aa47660]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2523706584]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fb0b19157666a587]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-047e343b5a41f48ac]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f501f908d74e8b941080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db33977869800d9a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0685761d5db013174]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:loadbalancer/app/go-simple-server-alb/d39af7559b0cb93f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0684b2b24e88ad24a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0699329c02acfbf41]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0972f78fece1f608c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0df7b7b9e8938f85a]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09afe4d2b31cc1a601080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02f39c8c10ab626461080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:listener/app/go-simple-server-alb/d39af7559b0cb93f/1e4218695e380ce0]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:listener-rule/app/go-simple-server-alb/d39af7559b0cb93f/1e4218695e380ce0/49418536847c9a9a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"517eb3f8f391547f81236aec4e40b35bd2326d53","Vars":{},"WorkflowName":"Terraform"} -->